backend/tests/performance/load-test.yml
config:
  target: 'http://localhost:8000'
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"
    - duration: 60
      arrivalRate: 5
      name: "Ramp down"
  defaults:
    headers:
      Content-Type: 'application/json'

scenarios:
  - name: "Health Check"
    weight: 20
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "API Endpoints"
    weight: 40
    flow:
      - get:
          url: "/api/v1/health"
          expect:
            - statusCode: 200
      - get:
          url: "/ready"
          expect:
            - statusCode: 200

  - name: "Authentication Flow"
    weight: 30
    flow:
      - post:
          url: "/api/v1/auth/register"
          json:
            email: "test{{ $randomInt(1, 10000) }}@example.com"
            password: "TestPassword123!"
            full_name: "Test User {{ $randomInt(1, 10000) }}"
          expect:
            - statusCode: [200, 201, 400, 409]

  - name: "Document Upload"
    weight: 10
    flow:
      - post:
          url: "/api/v1/documents/upload"
          json:
            filename: "test-document-{{ $randomInt(1, 10000) }}.txt"
            content: "This is a test document content for load testing."
          expect:
            - statusCode: [200, 201, 400, 401, 403]